Repository: 84000/data-translation-memory
Catalog: toh68_84000-ascertaining-the-vinaya-upali-s-questions.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འདུལ་བ་རྣམ་པར་གཏན་ལ་དབབ་པ་ཉེ་བར་འཁོར་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Ascertaining the Vinaya: Upāli’s Questions

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time:

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཐམ་པ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Bhagavān was dwelling in Śrāvastī, at Anāthapiṇḍada’s park in Prince Jeta’s Grove, together with a great monastic assembly of about five hundred monks as well as a thousand bodhisattvas.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཟིགས་ཏེ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ཁྱེད་ཅག་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ན་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པར་ཡང་དག་པར་བསྒྲུབས་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡང་དག་པར་གཟུང་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐབས་དང་། ཚུལ་དང་། བསམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐྱང་བར་སུ་སྤྲོ།
en: The Bhagavān looked upon those bodhisattva mahāsattvas with a gaze like an elephant’s and said to them, “Sons of noble birth, for the sake of upholding the holy Dharma in the future, in later times, who among you wishes to take up the unsurpassed, completely perfect awakening that took the Tathāgata countless myriads of eons to accomplish? Who among you, for the sake of bringing beings to maturity, wishes to nurture them by means of various methods, ways, and ideas?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མ་མཆིས་པར་ཡང་དག་པར་བསྒྲུབས་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡང་དག་པར་འཛིན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སེང་གེས་གསོལ་པ།
en: Then the bodhisattva mahāsattva Maitreya arose from his seat, adjusted his upper robe on one shoulder, knelt on his right knee, bowed to the Bhagavān with his palms joined in devotion, and said, “Bhagavān, for the sake of upholding the holy Dharma in the future, in later times, I wish to take up the unsurpassed, completely perfect awakening that took the Tathāgata countless myriads of eons to accomplish.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཐབས་དང་། ཚུལ་དང་། བསམ་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོང་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་གསོལ་པ།
en: The bodhisattva Siṃha said, “Bhagavān, I wish to nurture beings using various methods, ways, and ideas.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ངན་སོང་དུ་མཆི་བ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ།
en: The bodhisattva Vajrapāṇi said, “Bhagavān, I wish to release beings from going to the lower realms.”

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་གང་ཟག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཏོག་གིས་གསོལ་པ།
en: The bodhisattva Youthful Mañjuśrī said, “Bhagavān, I wish to fulfill the individual aspirations of beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་མ་འཚལ་བ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཏོག་གིས་གསོལ་པ།
en: The bodhisattva Jñānaketu said, “Bhagavān, I wish to bring untold numbers of beings to maturity.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་ཏོག་གིས་གསོལ་པ།
en: The bodhisattva Dharmaketu said, “Bhagavān, I wish to bring beings to maturity through the gift of Dharma.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཡོན་ཏན་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་ཏོག་གིས་གསོལ་པ།
en: The bodhisattva Candraketu said, “Bhagavān, I wish to bring beings to maturity by means of good qualities.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཐེག་པ་བདེ་བས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བག་ཚ་བ་མེད་པས་གསོལ་པ།
en: The bodhisattva Sūryaketu said, “Bhagavān, I wish to bring beings to maturity by means of the easy vehicle.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་གྱི་ཁམས་མཐའ་ཡས་པ་དག་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དང་། ཡོངས་སུ་འཛིན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་གིས་གསོལ་པ།
en: The bodhisattva Niḥśaṅka said, “Bhagavān, I wish to bring the limitless realms of beings to maturity and to support them.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་མིང་འབྲས་བུ་མཆིས་པར་སྒྲོགས་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་མི་ཟད་པས་གསོལ་པ།
en: The bodhisattva Bhadrapāla said, “Bhagavān, I wish to bring beings to maturity by proclaiming the names they are to attain as result.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སྨོན་ལམ་རྒྱ་ཆེན་པོས་སེམས་ཅན་གྱི་ཁམས་བས་པར་མ་འཚལ་བ་རྣམས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་གསོལ་པ།
en: The bodhisattva Akṣayamati said, “Bhagavān, I wish to liberate inexhaustible realms of beings through extensive aspirations.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མིག་བཟང་གིས་གསོལ་པ།
en: The bodhisattva Youthful Candraprabha said, “Bhagavān, I wish to supply beings with all the requisites of happiness.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་བདེ་བ་དང་ཡིད་བདེ་བའི་རྩ་བ་ཉེ་བར་སྒྲུབ་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསོལ་པ།
en: The bodhisattva Sunetra said, “Bhagavān, I wish to establish the foundation for the happiness and contentment of beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ངན་སོང་དང་ངན་འགྲོ་དག་ལས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་ཀྱིས་གསོལ་པ།
en: The bodhisattva Avalokiteśvara said, “Bhagavān, I wish to protect beings from lower realms and bad rebirths.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ངན་སོང་དག་ལས་མ་རྒལ་བའི་སེམས་ཅན་རྣམས་སྒྲོལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་ཅན་གྱིས་གསོལ་པ།
en: The bodhisattva Mahā­sthāma­prāpta said, “Bhagavān, I wish to save beings who have not escaped from the lower realms.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་མ་དུལ་བ་རྣམས་འདུལ་བའི་ཤུལ་ཉེ་བར་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཡིད་བཟངས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Rāśika said, “Bhagavān, I wish to teach undisciplined beings the way of discipline.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་དམན་པ་ལ་མོས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དེས་པས་གསོལ་པ།
en: The bodhisattva Sumanas said, “Bhagavān, I wish to bring beings with inferior inclinations to maturity.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་ཤེས་རབ་དམན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་ཕུང་པོས་གསོལ་པ།
en: The bodhisattva Sūrata said, “Bhagavān, I wish to bring beings with inferior wisdom to maturity.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་མེད་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པས་གསོལ་པ།
en: The bodhisattva Tejorāśi said, “Bhagavān, I wish to bring beings who have been born from the wombs of animals to maturity.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཤུལ་ཡང་དག་པར་སྟོན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་དགའས་གསོལ་པ།
en: The bodhisattva Recognizer of Unafflicted Realization said, “Bhagavān, I wish to bring beings to maturity by correctly teaching them the way.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་བདེ་བའི་ཡོ་བྱད་ཚད་མ་མཆིས་པ་དག་ཉེ་བར་སྒྲུབ་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་བཟང་གིས་གསོལ་པ།
en: The bodhisattva Priya­darśana said, “Bhagavān, I wish to equip beings with the immeasurable requisites of happiness.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སྡུག་བསྔལ་དྲན་པར་བགྱིད་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ།
en: The bodhisattva Excellent Faculties said, “Bhagavān, I wish to bring beings to maturity by causing them to reflect on suffering.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཡང་དག་པར་ཞུགས་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་བསམས་པ་ཙམ་གྱིས་ཡི་དགས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉི་འོད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Engaged in Inconceivable Liberation said, “Bhagavān, with merely a thought I wish to liberate beings born in the world of pretas.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་ཡོངས་སུ་མ་སྨིན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དྲི་མ་མེད་པར་གྲགས་པས་གསོལ་པ།
en: The bodhisattva Sūryaprabha said, “Bhagavān, I wish to bring to maturity those beings who are not yet mature.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་སྟོབས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Vimalakīrti said, “Bhagavān, I wish to fulfill every intention beings have.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་ཤུལ་འགུམས་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཡིད་གཉིས་སྤོང་གིས་གསོལ་པ།
en: The bodhisattva Tejobala said, “Bhagavān, I wish to destroy the way beings take unfortunate rebirths.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་དམན་པ་རྣམས་སྒྲོལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བག་ཚ་བ་མེད་པར་གནས་པས་གསོལ་པ།
en: The bodhisattva Vimatiprahāṇa said, “Bhagavān, I wish to liberate inferior beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་བསྡུ་བའི་སླད་དུ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དཔལ་གྱིས་གསོལ་པ།
en: The bodhisattva Niḥśaṅka­sthāna said, “Bhagavān, for the sake of gathering beings I wish to express encouragement by saying ‘Wonderful!’

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པ་རྣམས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གནས་པ་དཔག་མེད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Jñānaśrī said, “Bhagavān, I wish to bring beings to maturity according to their varying predispositions.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་འདུས་མ་བགྱིས་ཀྱི་ཤུལ་ཉེ་བར་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་བག་ཚ་བ་མེད་པར་གནས་པས་གསོལ་པ།
en: The bodhisattva Boundless Stillness said, “Bhagavān, I wish to teach beings the way of the unconditioned.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་མོས་པ་ཇི་ལྟ་བ་བཞིན་ཡང་དག་པར་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་དཔལ་གྱིས་གསོལ་པ།
en: The bodhisattva Fearless toward All Phenomena said, “Bhagavān, I wish to teach beings according to their own predisposition.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་རིན་པོ་ཆེའི་ཕུང་པོ་ཀུན་ཏུ་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོས་གསོལ་པ།
en: The bodhisattva Ratnaśrī said, “Bhagavān, I wish to display a heap of jewels to beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་གཟུགས་སྡུག་པ་སྟོན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་གཟི་བརྗིད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Sumati said, “Bhagavān, I wish to bring beings to maturity by showing them a beautiful form.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་གཅུགས་པས་སེམས་ཅན་རྣམས་ཡང་དག་པར་འཛིན་ཅིང་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་བཟང་གིས་གསོལ་པ།
en: The bodhisattva Vimalatejas said, “Bhagavān, I wish to support and bring beings to maturity through affection.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སྔོན་གྱི་སྐྱེ་བ་རྗེས་སུ་དྲན་པར་བགྱིད་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་འོད་ཟེར་གྱིས་གསོལ་པ།
en: The bodhisattva Maṇibhadra said, “Bhagavān, I wish to bring beings to maturity by causing them to remember their past births.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཡང་དག་པའི་སྨོན་ལམ་གྱིས་སེམས་ཅན་རྣམས་འདྲེན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དཔལ་བཟང་པོས་གསོལ་པ།
en: The bodhisattva Puṇyaraśmi said, “Bhagavān, I wish to guide beings by means of perfect aspiration prayers.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་དག་ལས་གཏན་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས་གསོལ་པ།
en: The bodhisattva Bhadraśrī said, “Bhagavān, I wish to permanently liberate beings from suffering.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་རིན་པོ་ཆེ་དག་གིས་བདེ་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Ratnapāṇi said, “Bhagavān, I wish to make beings happy with jewels.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་དབུལ་པོ་རྣམས་ཀྱི་དབུལ་བ་མ་མཆིས་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ།
en: The bodhisattva Mati said, “Bhagavān, I wish to end the poverty of poor beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་འོད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Sarva­nīvaraṇa­viṣkambhin said, “Bhagavān, I wish to liberate beings from all the afflictions.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་ཤུལ་བཟང་པོ་ཉེ་བར་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་གཟུགས་སྟོན་གྱིས་གསོལ་པ།
en: The bodhisattva Vajra Light said, “Bhagavān, I wish to teach beings the exalted way.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་བསམ་པ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བགྱིད་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་མངོན་པར་འཕགས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Manifesting the Appearance of Good Qualities said, “Bhagavān, I wish to liberate beings by causing all their thoughts to be joyful.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་སྦྱང་བ་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་གསོལ་པ།
en: The bodhisattva Exalted Dharma said, “Bhagavān, I wish to show the pure eye of Dharma to beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་སྒྲིབ་པ་དག་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འབྱུང་གིས་གསོལ་པ།
en: The bodhisattva Vajragarbha said, “Bhagavān, I wish to liberate beings from the obscurations.

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་ཐར་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཅི་ཡང་མིན་གྱིས་གསོལ་པ།
en: The bodhisattva Dharmākara said, “Bhagavān, I wish to liberate beings through the Dharma.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་དུག་ཐམས་ཅད་གཞིལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཟླ་མཆོག་གིས་གསོལ་པ།
en: The bodhisattva Nothing said, “Bhagavān, I wish to eliminate all the poisonous afflictions of beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་ཕྱོགས་རབ་ཏུ་སྟོན་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Candrottara said, “Bhagavān, I wish to teach the perspective of the Dharma to beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་སྦྱིན་པ་སྩོལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུ་འོད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Siṃhamati said, “Bhagavān, I wish to give the gift of Dharma to beings.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་དམན་པའི་གནས་ནས་ཡོངས་སུ་ཐར་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་དཔལ་གྱིས་གསོལ་པ།
en: The bodhisattva Luminous Youth said, “Bhagavān, I wish to liberate beings from inferior states.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཤུལ་བཟང་པོ་སྟོན་པས་སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་ཤུལ་འགོག་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གསེར་འོད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Glorious Awakening said, “Bhagavān, I wish to block beings’ way to lower rebirths by teaching them the exalted way.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་ལུས་སྟོན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་དཔལ་གྱིས་གསོལ་པ།
en: The bodhisattva Suvarṇa­prabha said, “Bhagavān, I wish to bring beings to maturity by displaying a physical body.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་དོན་བགྱིད་པ་རྣམས་ཀྱི་དོན་བགྱིད་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་འཛིན་གྱིས་གསོལ་པ།
en: The bodhisattva Puṇyaketu said, “Bhagavān, I wish to help those beings who help others.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བའི་སྒོ་འགུམས་པར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩི་འཆང་གིས་གསོལ་པ།
en: The bodhisattva Jagatīndhara said, “Bhagavān, I wish to destroy beings’ gateway into hell.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་སྒྲོལ་བར་སྤྲོ་ལགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དྲ་བ་ཅན་གྱི་འོད་གཞོན་ནུར་གྱུར་པས་གསོལ་པ།
en: The bodhisattva Nectar Holder said, “Bhagavān, I wish to save beings from saṃsāra.”

source: བཅོམ་ལྡན་འདས་བདག་ནི་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་འོད་བསྟན་པས་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བགྱིད་པར་སྤྲོ་ལགས་སོ།
en: The youthful bodhisattva Jālinīprabha said, “Bhagavān, in the future, in later times, I wish to pacify beings’ afflictions through displays of light.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་གོ་ཆ་ལ་འཇུག་པ་བསྟན་པ་དེ་ལྟ་བུ་འདི་ཐོས་ནས་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བར་འཛིན་པར་གྱུར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: After hearing such revelations from the bodhisattvas about donning the armor that will mature beings, the venerable Śāriputra was seized with wonder and amazement.

source: །བཅོམ་ལྡན་འདས་ཀྱེ་མ་ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་སྙིང་རྗེ་ཆེན་པོ་དང་ཐབས་ལ་མཁས་པ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆ་ཆེན་པོ་བགོས་པ་དང་། ཇི་ཙམ་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐུལ་བར་དཀའ་བ་དང་། གཏིང་དཔག་པར་དཀའ་བ་དང་། བསྙེན་པར་དཀའ་བ་དང་། རྫི་བར་དཀའ་བ་དང་། ཟིལ་གྱིས་མི་ནོན་པའི་གཟི་བརྗིད་དང་ལྡན་པ་ནི་ངོ་མཚར་ལགས་ཏེ།
en: He said to the Bhagavān, “Ah! Bhagavān, the great compassion possessed by these bodhisattva mahāsattvas is amazing, as is their inconceivable skill in means and their donning of the great armor of stable diligence. It is amazing how these bodhisattvas cannot be overcome by any being, how difficult they are to fathom, to meet with, or to subjugate, and how their brilliance cannot be overcome.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟི་བརྗིད་ཟིལ་གྱིས་མི་ནོན་པ་རྣམས་ཀྱི་དྲུང་དུ་མགོ་དང་། ལག་པ་དང་། རྐང་པ་དང་། མིག་སློང་བ་དག་མཆིས་ཏེ། དངོས་པོ་ཐམས་ཅད་སློང་བར་བགྱིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀུན་ཏུ་ཞུམ་པར་མི་བགྱིད།
en: Furthermore, Bhagavān, when supplicants come before these bodhisattva mahāsattvas, whose brilliance cannot be overcome, and beg for their heads, hands, feet, and eyes—even when they beg for everything—these bodhisattva mahāsattvas do not recoil or become discouraged but rather are overjoyed.

source: སྒྱིད་ལུག་པར་མི་བགྱིད་ཅིང་རབ་ཏུ་སྤྲོ་བར་བགྱིད་པ་ནི་བདག་ངོ་མཚར་དུ་འཛིན་ལགས་སོ།
en: This is amazing to me.

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བདག་འདི་སྙམ་དུ་སེམས་ལགས་ཏེ། སེམས་ཅན་གང་སུ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་གནོད་པར་བགྱིས་ཏེ་ནང་དང་ཕྱིའི་དངོས་པོ་དག་སློང་བར་བགྱིད་པ་དེ་དག་ཐམས་ཅད་ནི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤ་སྟག་ཏུ་འགྱུར་བར་སེམས་ལགས་སོ།
en: Bhagavān, I also think that any beings who harm bodhisattva mahāsattvas and then ask for their various inner and outer constituents will surely become bodhisattva mahāsattvas who rest in inconceivable liberation.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: The Bhagavān replied to the venerable Śāriputra, “So it is, Śāriputra, so it is!

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་དང་། ཐབས་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ནི་དེ་ལྟ་བུ་ཡིན་ཏེ།
en: Such is the scope of these bodhisattvas’ samādhi, methods, wisdom, and gnosis.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡུལ་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་མ་ཡིན་ནོ།
en: Śāriputra, the scope of these bodhisattvas is not that of śrāvakas or pratyekabuddhas.

source: །ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཀུན་དུ་སྟོན་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་ལས་མི་གཡོའོ།
en: Śāriputra, bodhisattva mahāsattvas, in order to meet the inclinations of beings, manifest all the emanations of the buddhas, but while doing so they do not waver from their bodhisattva nature.

source: །ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སེམས་ཅན་ཁྱིམ་བདག་གི་རྒྱགས་པས་མྱོས་པ་རྣམས་ལ་དབང་ཕྱུག་གིས་རྒྱགས་པ་བསལ་བའི་ཕྱིར་ཁྱིམ་བདག་གི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: “Śāriputra, bodhisattva mahāsattvas will manifest the bodies of householders in order to dispel the delusions of grandeur held by householders who are intoxicated with arrogance.

source: །སེམས་ཅན་སྤྲོ་བས་རྒྱགས་ཤིང་མྱོས་པ་རྣམས་ལ་སྤྲོ་བའི་རྒྱགས་པ་བསལ་བའི་ཕྱིར་ཚན་པོ་ཆེ་ཆེན་པོའི་སྟོབས་དང་། སྲེད་མེད་ཀྱི་བུའི་སྤྲོ་བའི་སྟོབས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: In order to remove the manic arrogance of beings who are inflated and intoxicated by mania, they display the power of a champion, or the exuberant power of Nārāyaṇa.

source: །སེམས་ཅན་མྱ་ངན་ལས་འདས་པ་དོན་དུ་གཉེར་བ་རྣམས་ལ་མྱ་ངན་ལས་འདས་པའི་ལམ་སྣ་ཚོགས་ཉེ་བར་སྟོན་པར་བྱེད་དེ།
en: They reveal the various paths to nirvāṇa for those beings who seek nirvāṇa.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་དོན་དུ་གཉེར་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་ཉན་ཐོས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: They display the form of śrāvakas to those beings oriented to the Śrāvakayāna and use the Śrāvakayāna to bring them to complete nirvāṇa.

source: །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དོན་དུ་གཉེར་བའི་སེམས་ཅན་རྣམས་ལ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་རང་སངས་རྒྱས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: They display the form of pratyekabuddhas to beings oriented to the Pratyekabuddhayāna so that they can direct them toward dependent arising.

source: །བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་སེམས་ཅན་རྣམས་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་ཐོབ་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་པར་བྱེད་དེ།
en: They display the forms of buddhas to those beings who seek awakening so that they may attain all the qualities of a buddha.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཐབས་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་རབ་ཏུ་འགོད་པར་བྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Śāriputra, in this way, once bodhisattva mahāsattvas have matured the realm of beings using a variety of methods, they set beings firmly in the qualities of buddhahood.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཤིན་ཏུ་མྱ་ངན་ལས་འདས་པའི་རྣམ་པར་ཐར་པ་མ་གཏོགས་པར་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་ཐར་པ་གཞན་མེད་དེ།
en: Śāriputra, beings will find no liberation apart from the liberation of final nirvāṇa, the gnosis of the tathāgatas.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་ཕྱིར་རོ།
en: This is why they are called tathāgatas

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ནི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་བཞིན་འདི་ཐུགས་སུ་ཆུད་དེ།
en: They are called tathāgatas because tathāgatas know the nature of reality just as it is.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། གདགས་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་རིག་པར་མཛད་དེ།
en: They are called tathāgatas because they use various concepts to induce understanding in beings.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པ་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། སེམས་ཅན་བཅིངས་པ་རྣམས་ལ་ཐར་པ་ཉེ་བར་སྟོན་པར་མཛད་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། སེམས་ཅན་ལམ་ངན་པར་ཞུགས་པ་རྣམས་ལ་ལམ་བཟང་པོ་ཉེ་བར་སྟོན་པར་མཛད་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། སྟོང་པ་ཉིད་གསུང་བ་དང་། སྟོང་པ་ཉིད་ལས་ངེས་པར་བྱུང་བས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་ཕྱིར་རོ།
en: They are called tathāgatas because they possess all virtuous qualities and have abandoned all nonvirtuous qualities. They are called tathāgatas because they demonstrate liberation to beings who are in bondage. They are called tathāgatas because they reveal the exalted path to beings who have embarked on an evil path. They are called tathāgatas because they teach emptiness and arise from emptiness.
